{"link": "https://www.wikipedia.org/", "keywords": "Biodiversity", "summary": ": India is a megadiverse country and contains 8.6% of all mammal species, 13.7% of bird species, 7.9% of reptile species, 6% of amphibian species, 12.2% of fish species, and 6.0% of all flowering plant species. It also contains four of the world's 34 biodiversity hotspots, with a third of Indian plant species being endemic.: India's forest cover is 21.71% of the country's total land area and very dense forest, with a canopy density of greater than 70%, covers 3.02% of India's land area. It is mainly found in the tropical moist forest of the Andaman Islands, the Western Ghats, and Northeast India.: India has moderately dense forest (40-70% canopy density) that covers 9.39% of its land area, and open forest (10-40% canopy density) that covers 9.26%. It also has two natural zones of thorn forest in the Deccan Plateau and Indo-Gangetic plain.: Notable indigenous trees from the Indian subcontinent include the astringent Azadirachta indica (neem) and the luxuriant Ficus religiosa (peepul). Neem is widely used for herbal medicine and the Ficus religiosa was featured on ancient seals of Mohenjo-daro and under which the Buddha sought enlightenment.\nIndia separated from Gondwana, a southern supercontinent, over 100 million years ago. When India collided with Eurasia, it caused a mass exchange of species.: Volcanism and climatic changes caused the extinction of many endemic species in India. Later, mammals from Asia entered through two zoogeographical passes around the Himalayas, leading to lower endemism among India's mammals (12.6%). Some vulnerable species in India include the hooded leaf monkey and Beddome's toad. India contains 172 endangered animal species, including the Bengal tiger and Ganges river dolphin.\n\nCritically endangered species in India include the gharial, great Indian bustard, and Indian white-rumped vulture. Before human settlement and agriculture, the thorn forests of Punjab were home to large herds of blackbuck that were preyed on by Asiatic cheetahs, both of which are now severely endangered or extinct. Human encroachment has had a devastating effect on Indian wildlife.:\nIn 1935, a system of national parks and protected areas was established and has since been expanded.: India enacted the Wildlife Protection Act and Project Tiger in 1972, and the Forest Conservation Act was amended in 1988. There are more than 500 wildlife sanctuaries and 13 biosphere reserves registered in India. 25 wetlands are also registered under the Ramsar Convention.:\n\nThe differences between a public and private blockchain are mainly related to who has the authority to access the network, modify its rules, and validate transactions. A public blockchain is open to anyone, allowing anyone to join and participate in the network. On the other hand, a private blockchain is restricted and requires permission to join, making it more secure and offering greater control over its users and data. Additionally, public blockchains are usually decentralized, meaning that there is no central authority, while private blockchains are typically managed by an organization or a group of people."}